Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/adc.h
/* -------- ADC_CTRLD : (ADC Offset: 0x10) (R/W 32) Control D Register -------- */
#define ADC_CTRLD_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLD) Control D Register  Reset Value */

#define ADC_CTRLD_CTLCKDIV_Pos                _UINT32_(8)                                          /* (ADC_CTRLD) Control Clock Divider Position */
#define ADC_CTRLD_CTLCKDIV_Msk                (_UINT32_(0x3F) << ADC_CTRLD_CTLCKDIV_Pos)           /* (ADC_CTRLD) Control Clock Divider Mask */
#define ADC_CTRLD_CTLCKDIV(value)             (ADC_CTRLD_CTLCKDIV_Msk & (_UINT32_(value) << ADC_CTRLD_CTLCKDIV_Pos)) /* Assignment of value for CTLCKDIV in the ADC_CTRLD register */
#define ADC_CTRLD_CHNEN0_Pos                  _UINT32_(16)                                         /* (ADC_CTRLD) Core 0 Digital Channel Enable Position */
#define ADC_CTRLD_CHNEN0_Msk                  (_UINT32_(0x1) << ADC_CTRLD_CHNEN0_Pos)              /* (ADC_CTRLD) Core 0 Digital Channel Enable Mask */
#define ADC_CTRLD_CHNEN0(value)               (ADC_CTRLD_CHNEN0_Msk & (_UINT32_(value) << ADC_CTRLD_CHNEN0_Pos)) /* Assignment of value for CHNEN0 in the ADC_CTRLD register */
#define ADC_CTRLD_ANLEN0_Pos                  _UINT32_(20)                                         /* (ADC_CTRLD) Analog and Bias circuitry Enable for core 0 Position */
#define ADC_CTRLD_ANLEN0_Msk                  (_UINT32_(0x1) << ADC_CTRLD_ANLEN0_Pos)              /* (ADC_CTRLD) Analog and Bias circuitry Enable for core 0 Mask */
#define ADC_CTRLD_ANLEN0(value)               (ADC_CTRLD_ANLEN0_Msk & (_UINT32_(value) << ADC_CTRLD_ANLEN0_Pos)) /* Assignment of value for ANLEN0 in the ADC_CTRLD register */
#define ADC_CTRLD_WKUPEXP_Pos                 _UINT32_(24)                                         /* (ADC_CTRLD) Wakeup cycles Position */
#define ADC_CTRLD_WKUPEXP_Msk                 (_UINT32_(0xF) << ADC_CTRLD_WKUPEXP_Pos)             /* (ADC_CTRLD) Wakeup cycles Mask */
#define ADC_CTRLD_WKUPEXP(value)              (ADC_CTRLD_WKUPEXP_Msk & (_UINT32_(value) << ADC_CTRLD_WKUPEXP_Pos)) /* Assignment of value for WKUPEXP in the ADC_CTRLD register */
#define ADC_CTRLD_VREFSEL_Pos                 _UINT32_(28)                                         /* (ADC_CTRLD) Voltage Reference Select Position */
#define ADC_CTRLD_VREFSEL_Msk                 (_UINT32_(0x7) << ADC_CTRLD_VREFSEL_Pos)             /* (ADC_CTRLD) Voltage Reference Select Mask */
#define ADC_CTRLD_VREFSEL(value)              (ADC_CTRLD_VREFSEL_Msk & (_UINT32_(value) << ADC_CTRLD_VREFSEL_Pos)) /* Assignment of value for VREFSEL in the ADC_CTRLD register */
#define   ADC_CTRLD_VREFSEL_AVDD_AVSS_Val     _UINT32_(0x0)                                        /* (ADC_CTRLD) AVDD and AVSS  */
#define   ADC_CTRLD_VREFSEL_EXTERNAL_VREFH_AVSS_Val _UINT32_(0x1)                                        /* (ADC_CTRLD) External VREFH and AVSS  */
#define ADC_CTRLD_VREFSEL_AVDD_AVSS           (ADC_CTRLD_VREFSEL_AVDD_AVSS_Val << ADC_CTRLD_VREFSEL_Pos) /* (ADC_CTRLD) AVDD and AVSS Position */
#define ADC_CTRLD_VREFSEL_EXTERNAL_VREFH_AVSS (ADC_CTRLD_VREFSEL_EXTERNAL_VREFH_AVSS_Val << ADC_CTRLD_VREFSEL_Pos) /* (ADC_CTRLD) External VREFH and AVSS Position */
#define ADC_CTRLD_Msk                         _UINT32_(0x7F113F00)                                 /* (ADC_CTRLD) Register Mask  */

#define ADC_CTRLD_CHNEN_Pos                   _UINT32_(16)                                         /* (ADC_CTRLD Position) Core x Digital Channel Enable */
#define ADC_CTRLD_CHNEN_Msk                   (_UINT32_(0x1) << ADC_CTRLD_CHNEN_Pos)               /* (ADC_CTRLD Mask) CHNEN */
#define ADC_CTRLD_CHNEN(value)                (ADC_CTRLD_CHNEN_Msk & (_UINT32_(value) << ADC_CTRLD_CHNEN_Pos)) 
#define ADC_CTRLD_ANLEN_Pos                   _UINT32_(20)                                         /* (ADC_CTRLD Position) Analog and Bias circuitry Enable for core x */
#define ADC_CTRLD_ANLEN_Msk                   (_UINT32_(0x1) << ADC_CTRLD_ANLEN_Pos)               /* (ADC_CTRLD Mask) ANLEN */
#define ADC_CTRLD_ANLEN(value)                (ADC_CTRLD_ANLEN_Msk & (_UINT32_(value) << ADC_CTRLD_ANLEN_Pos)) 

/* -------- ADC_CMPCTRL : (ADC Offset: 0xB0) (R/W 32) Comparator Control -------- */
#define ADC_CMPCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_CMPCTRL) Comparator Control  Reset Value */

#define ADC_CMPCTRL_ADCMPLO_Pos               _UINT32_(0)                                          /* (ADC_CMPCTRL) Low Limit of Digital Comparator Position */
#define ADC_CMPCTRL_ADCMPLO_Msk               (_UINT32_(0xFFF) << ADC_CMPCTRL_ADCMPLO_Pos)         /* (ADC_CMPCTRL) Low Limit of Digital Comparator Mask */
#define ADC_CMPCTRL_ADCMPLO(value)            (ADC_CMPCTRL_ADCMPLO_Msk & (_UINT32_(value) << ADC_CMPCTRL_ADCMPLO_Pos)) /* Assignment of value for ADCMPLO in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_CMPEN_Pos                 _UINT32_(12)                                         /* (ADC_CMPCTRL) Comparator Enable Position */
#define ADC_CMPCTRL_CMPEN_Msk                 (_UINT32_(0x1) << ADC_CMPCTRL_CMPEN_Pos)             /* (ADC_CMPCTRL) Comparator Enable Mask */
#define ADC_CMPCTRL_CMPEN(value)              (ADC_CMPCTRL_CMPEN_Msk & (_UINT32_(value) << ADC_CMPCTRL_CMPEN_Pos)) /* Assignment of value for CMPEN in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_IELOLO_Pos                _UINT32_(13)                                         /* (ADC_CMPCTRL) Enable VAL < CMPLO Position */
#define ADC_CMPCTRL_IELOLO_Msk                (_UINT32_(0x1) << ADC_CMPCTRL_IELOLO_Pos)            /* (ADC_CMPCTRL) Enable VAL < CMPLO Mask */
#define ADC_CMPCTRL_IELOLO(value)             (ADC_CMPCTRL_IELOLO_Msk & (_UINT32_(value) << ADC_CMPCTRL_IELOLO_Pos)) /* Assignment of value for IELOLO in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_IELOHI_Pos                _UINT32_(14)                                         /* (ADC_CMPCTRL) Enable VAL >= CMPLO Position */
#define ADC_CMPCTRL_IELOHI_Msk                (_UINT32_(0x1) << ADC_CMPCTRL_IELOHI_Pos)            /* (ADC_CMPCTRL) Enable VAL >= CMPLO Mask */
#define ADC_CMPCTRL_IELOHI(value)             (ADC_CMPCTRL_IELOHI_Msk & (_UINT32_(value) << ADC_CMPCTRL_IELOHI_Pos)) /* Assignment of value for IELOHI in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_IEBTWN_Pos                _UINT32_(15)                                         /* (ADC_CMPCTRL) Enable CMPLO <= VAL < CMPHI Position */
#define ADC_CMPCTRL_IEBTWN_Msk                (_UINT32_(0x1) << ADC_CMPCTRL_IEBTWN_Pos)            /* (ADC_CMPCTRL) Enable CMPLO <= VAL < CMPHI Mask */
#define ADC_CMPCTRL_IEBTWN(value)             (ADC_CMPCTRL_IEBTWN_Msk & (_UINT32_(value) << ADC_CMPCTRL_IEBTWN_Pos)) /* Assignment of value for IEBTWN in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_ADCMPHI_Pos               _UINT32_(16)                                         /* (ADC_CMPCTRL) High Limit of Digital Comparator Position */
#define ADC_CMPCTRL_ADCMPHI_Msk               (_UINT32_(0xFFF) << ADC_CMPCTRL_ADCMPHI_Pos)         /* (ADC_CMPCTRL) High Limit of Digital Comparator Mask */
#define ADC_CMPCTRL_ADCMPHI(value)            (ADC_CMPCTRL_ADCMPHI_Msk & (_UINT32_(value) << ADC_CMPCTRL_ADCMPHI_Pos)) /* Assignment of value for ADCMPHI in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_IEHILO_Pos                _UINT32_(28)                                         /* (ADC_CMPCTRL) Enable VAL < CMPHI Position */
#define ADC_CMPCTRL_IEHILO_Msk                (_UINT32_(0x1) << ADC_CMPCTRL_IEHILO_Pos)            /* (ADC_CMPCTRL) Enable VAL < CMPHI Mask */
#define ADC_CMPCTRL_IEHILO(value)             (ADC_CMPCTRL_IEHILO_Msk & (_UINT32_(value) << ADC_CMPCTRL_IEHILO_Pos)) /* Assignment of value for IEHILO in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_IEHIHI_Pos                _UINT32_(29)                                         /* (ADC_CMPCTRL) Enable VAL >= CMPHI Position */
#define ADC_CMPCTRL_IEHIHI_Msk                (_UINT32_(0x1) << ADC_CMPCTRL_IEHIHI_Pos)            /* (ADC_CMPCTRL) Enable VAL >= CMPHI Mask */
#define ADC_CMPCTRL_IEHIHI(value)             (ADC_CMPCTRL_IEHIHI_Msk & (_UINT32_(value) << ADC_CMPCTRL_IEHIHI_Pos)) /* Assignment of value for IEHIHI in the ADC_CMPCTRL register */
#define ADC_CMPCTRL_Msk                       _UINT32_(0x3FFFFFFF)                                 /* (ADC_CMPCTRL) Register Mask  */


/* -------- ADC_FLTCTRL : (ADC Offset: 0xC0) (R/W 32) Filter Control -------- */
#define ADC_FLTCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_FLTCTRL) Filter Control  Reset Value */

#define ADC_FLTCTRL_OVRSAM_Pos                _UINT32_(0)                                          /* (ADC_FLTCTRL) Oversampling Ratio Position */
#define ADC_FLTCTRL_OVRSAM_Msk                (_UINT32_(0x7) << ADC_FLTCTRL_OVRSAM_Pos)            /* (ADC_FLTCTRL) Oversampling Ratio Mask */
#define ADC_FLTCTRL_OVRSAM(value)             (ADC_FLTCTRL_OVRSAM_Msk & (_UINT32_(value) << ADC_FLTCTRL_OVRSAM_Pos)) /* Assignment of value for OVRSAM in the ADC_FLTCTRL register */
#define   ADC_FLTCTRL_OVRSAM_4_SAMPLES_Val    _UINT32_(0x0)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_16_SAMPLES_Val   _UINT32_(0x1)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_64_SAMPLES_Val   _UINT32_(0x2)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_256_SAMPLES_Val  _UINT32_(0x3)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_2_SAMPLES_Val    _UINT32_(0x4)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_8_SAMPLES_Val    _UINT32_(0x5)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_32_SAMPLES_Val   _UINT32_(0x6)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged  */
#define   ADC_FLTCTRL_OVRSAM_128_SAMPLES_Val  _UINT32_(0x7)                                        /* (ADC_FLTCTRL) (If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged  */
#define ADC_FLTCTRL_OVRSAM_4_SAMPLES          (ADC_FLTCTRL_OVRSAM_4_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_16_SAMPLES         (ADC_FLTCTRL_OVRSAM_16_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_64_SAMPLES         (ADC_FLTCTRL_OVRSAM_64_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_256_SAMPLES        (ADC_FLTCTRL_OVRSAM_256_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_2_SAMPLES          (ADC_FLTCTRL_OVRSAM_2_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_8_SAMPLES          (ADC_FLTCTRL_OVRSAM_8_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_32_SAMPLES         (ADC_FLTCTRL_OVRSAM_32_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged Position */
#define ADC_FLTCTRL_OVRSAM_128_SAMPLES        (ADC_FLTCTRL_OVRSAM_128_SAMPLES_Val << ADC_FLTCTRL_OVRSAM_Pos) /* (ADC_FLTCTRL) (If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged Position */
#define ADC_FLTCTRL_FMODE_Pos                 _UINT32_(3)                                          /* (ADC_FLTCTRL) Filter Mode Position */
#define ADC_FLTCTRL_FMODE_Msk                 (_UINT32_(0x1) << ADC_FLTCTRL_FMODE_Pos)             /* (ADC_FLTCTRL) Filter Mode Mask */
#define ADC_FLTCTRL_FMODE(value)              (ADC_FLTCTRL_FMODE_Msk & (_UINT32_(value) << ADC_FLTCTRL_FMODE_Pos)) /* Assignment of value for FMODE in the ADC_FLTCTRL register */
#define ADC_FLTCTRL_DATA16EN_Pos              _UINT32_(4)                                          /* (ADC_FLTCTRL) 16bit Averaging Mode Position */
#define ADC_FLTCTRL_DATA16EN_Msk              (_UINT32_(0x1) << ADC_FLTCTRL_DATA16EN_Pos)          /* (ADC_FLTCTRL) 16bit Averaging Mode Mask */
#define ADC_FLTCTRL_DATA16EN(value)           (ADC_FLTCTRL_DATA16EN_Msk & (_UINT32_(value) << ADC_FLTCTRL_DATA16EN_Pos)) /* Assignment of value for DATA16EN in the ADC_FLTCTRL register */
#define ADC_FLTCTRL_FLTEN_Pos                 _UINT32_(8)                                          /* (ADC_FLTCTRL) Filter Enable Position */
#define ADC_FLTCTRL_FLTEN_Msk                 (_UINT32_(0x1) << ADC_FLTCTRL_FLTEN_Pos)             /* (ADC_FLTCTRL) Filter Enable Mask */
#define ADC_FLTCTRL_FLTEN(value)              (ADC_FLTCTRL_FLTEN_Msk & (_UINT32_(value) << ADC_FLTCTRL_FLTEN_Pos)) /* Assignment of value for FLTEN in the ADC_FLTCTRL register */
#define ADC_FLTCTRL_FLTCHNID_Pos              _UINT32_(10)                                         /* (ADC_FLTCTRL) Channel ID Position */
#define ADC_FLTCTRL_FLTCHNID_Msk              (_UINT32_(0xF) << ADC_FLTCTRL_FLTCHNID_Pos)          /* (ADC_FLTCTRL) Channel ID Mask */
#define ADC_FLTCTRL_FLTCHNID(value)           (ADC_FLTCTRL_FLTCHNID_Msk & (_UINT32_(value) << ADC_FLTCTRL_FLTCHNID_Pos)) /* Assignment of value for FLTCHNID in the ADC_FLTCTRL register */
#define ADC_FLTCTRL_Msk                       _UINT32_(0x00003D1F)                                 /* (ADC_FLTCTRL) Register Mask  */


/* -------- ADC_CORCHDATAID : (ADC Offset: 0xD0) (R/W 32) Channel Ready DATA ID -------- */
#define ADC_CORCHDATAID_RESETVALUE            _UINT32_(0x00)                                       /*  (ADC_CORCHDATAID) Channel Ready DATA ID  Reset Value */

#define ADC_CORCHDATAID_CHRDYID_Pos           _UINT32_(0)                                          /* (ADC_CORCHDATAID) Channel Read ID Position */
#define ADC_CORCHDATAID_CHRDYID_Msk           (_UINT32_(0xF) << ADC_CORCHDATAID_CHRDYID_Pos)       /* (ADC_CORCHDATAID) Channel Read ID Mask */
#define ADC_CORCHDATAID_CHRDYID(value)        (ADC_CORCHDATAID_CHRDYID_Msk & (_UINT32_(value) << ADC_CORCHDATAID_CHRDYID_Pos)) /* Assignment of value for CHRDYID in the ADC_CORCHDATAID register */
#define ADC_CORCHDATAID_CORDYID_Pos           _UINT32_(4)                                          /* (ADC_CORCHDATAID) Core Read ID Position */
#define ADC_CORCHDATAID_CORDYID_Msk           (_UINT32_(0x3) << ADC_CORCHDATAID_CORDYID_Pos)       /* (ADC_CORCHDATAID) Core Read ID Mask */
#define ADC_CORCHDATAID_CORDYID(value)        (ADC_CORCHDATAID_CORDYID_Msk & (_UINT32_(value) << ADC_CORCHDATAID_CORDYID_Pos)) /* Assignment of value for CORDYID in the ADC_CORCHDATAID register */
#define ADC_CORCHDATAID_Msk                   _UINT32_(0x0000003F)                                 /* (ADC_CORCHDATAID) Register Mask  */


/* -------- ADC_CHRDYDAT : (ADC Offset: 0xD4) (R/W 32) Channel Ready Data Register -------- */
#define ADC_CHRDYDAT_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_CHRDYDAT) Channel Ready Data Register  Reset Value */

#define ADC_CHRDYDAT_CHRDYDAT_Pos             _UINT32_(0)                                          /* (ADC_CHRDYDAT) Channel Output Data Position */
#define ADC_CHRDYDAT_CHRDYDAT_Msk             (_UINT32_(0xFFFF) << ADC_CHRDYDAT_CHRDYDAT_Pos)      /* (ADC_CHRDYDAT) Channel Output Data Mask */
#define ADC_CHRDYDAT_CHRDYDAT(value)          (ADC_CHRDYDAT_CHRDYDAT_Msk & (_UINT32_(value) << ADC_CHRDYDAT_CHRDYDAT_Pos)) /* Assignment of value for CHRDYDAT in the ADC_CHRDYDAT register */
#define ADC_CHRDYDAT_LVL_Pos                  _UINT32_(24)                                         /* (ADC_CHRDYDAT) Level Setting Position */
#define ADC_CHRDYDAT_LVL_Msk                  (_UINT32_(0x1) << ADC_CHRDYDAT_LVL_Pos)              /* (ADC_CHRDYDAT) Level Setting Mask */
#define ADC_CHRDYDAT_LVL(value)               (ADC_CHRDYDAT_LVL_Msk & (_UINT32_(value) << ADC_CHRDYDAT_LVL_Pos)) /* Assignment of value for LVL in the ADC_CHRDYDAT register */
#define ADC_CHRDYDAT_DIFF_Pos                 _UINT32_(25)                                         /* (ADC_CHRDYDAT) Differential Setting Position */
#define ADC_CHRDYDAT_DIFF_Msk                 (_UINT32_(0x1) << ADC_CHRDYDAT_DIFF_Pos)             /* (ADC_CHRDYDAT) Differential Setting Mask */
#define ADC_CHRDYDAT_DIFF(value)              (ADC_CHRDYDAT_DIFF_Msk & (_UINT32_(value) << ADC_CHRDYDAT_DIFF_Pos)) /* Assignment of value for DIFF in the ADC_CHRDYDAT register */
#define ADC_CHRDYDAT_SIGN_Pos                 _UINT32_(26)                                         /* (ADC_CHRDYDAT) Sign Setting Position */
#define ADC_CHRDYDAT_SIGN_Msk                 (_UINT32_(0x1) << ADC_CHRDYDAT_SIGN_Pos)             /* (ADC_CHRDYDAT) Sign Setting Mask */
#define ADC_CHRDYDAT_SIGN(value)              (ADC_CHRDYDAT_SIGN_Msk & (_UINT32_(value) << ADC_CHRDYDAT_SIGN_Pos)) /* Assignment of value for SIGN in the ADC_CHRDYDAT register */
#define ADC_CHRDYDAT_FRACT_Pos                _UINT32_(27)                                         /* (ADC_CHRDYDAT) Fractional Setting Position */
#define ADC_CHRDYDAT_FRACT_Msk                (_UINT32_(0x1) << ADC_CHRDYDAT_FRACT_Pos)            /* (ADC_CHRDYDAT) Fractional Setting Mask */
#define ADC_CHRDYDAT_FRACT(value)             (ADC_CHRDYDAT_FRACT_Msk & (_UINT32_(value) << ADC_CHRDYDAT_FRACT_Pos)) /* Assignment of value for FRACT in the ADC_CHRDYDAT register */
#define ADC_CHRDYDAT_Msk                      _UINT32_(0x0F00FFFF)                                 /* (ADC_CHRDYDAT) Register Mask  */


/* -------- ADC_PFFDATA : (ADC Offset: 0xD8) ( R/ 32) APB FIFO Output Data -------- */
#define ADC_PFFDATA_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_PFFDATA) APB FIFO Output Data  Reset Value */

